backend/app/controllers/songs_controller.rb

    def index
        songs = Song.all
---
SELECT "songs".* FROM "songs"