backend/app/controllers/api/v1/songs_controller.rb

SELECT "songs".* FROM "songs"
---
    def index
        songs = Song.all

INSERT INTO "songs" ("title", "artist", "album", "album_cover", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Flashback"], ["artist", "Bassnectar"], ["album", "Noise vs Beauty"], ["album_cover", "https://i1.sndcdn.com/artworks-000082981108-s30svd-t500x500.jpg"], ["user_id", 1]]
---
    def create
        song = Song.create(song_params)

DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 6]]
---
    def destroy
        @song.destroy

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def set_song
        @song = Song.find_by(id: params[:id])