backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Enter"], ["LIMIT", 1]]
INSERT INTO "users" ("name") VALUES (?)  [["name", "Enter"]]
---
    def create
        if User.find_by(name: user_params[:name])
            user = User.find_by(name: user_params[:name])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.create(user_params)